#+TITLE: Cheatsheet
#+STARTUP: overview


** Destructor
/Is the ~destructor~ function called automatically/, when an objects goes out of scope?
Yes. Check this experiment:
#+BEGIN_SRC cpp :main no :flags -std=c++11
    #include <iostream>
    using namespace std;

    class Foo
    {
    public:
        Foo(){ cout << "Hellow from constructor" << endl;}

        ~Foo(){ cout << "Shit, Desctructor is here" << endl;}
    };

        int main(int argc, char *argv[])
        {
            {
                Foo a;
            }
            return 0;
        }
#+END_SRC
 
Does the compiler augment the body of a destructor with a destructor 
for every non-static data member?
#+BEGIN_SRC cpp :main no :flags -std=c++11 :results output raw
  #include <iostream>
  using namespace std;


  class Bar
  {
  public:
      Bar(){ cout << "Hello from Bar's constructor" << endl;}
      ~Bar(){ cout << "Shit, Bar's Destructor is here" << endl;}
  };


  class Foo
  {
  public:
      Foo(){ cout << "Hellow from constructor" << endl;}
      ~Foo(){ cout << "Shit, Desctructor is here" << endl;}
  private:
      Bar bar;
  };

  int main(int argc, char *argv[])
  {
      {
          Foo a;
          return 0;
      }
  }
#+END_SRC

#+RESULTS:
Hello from Bar's constructor
Hellow from constructor
Shit, Desctructor is here
Shit, Bar's Destructor is here
